import React from 'react';
import ButtonPrimary from './ButtonPrimary';
import AnimatedText from './AnimatedText';

const PartnersSection = () => {
  const partners = [
    {
      name: 'Двери Профи',
      image: '/logoExample.png',
    },
    {
      name: 'Техно Поставка',
      image: '/logoExample.png',
    },
    {
      name: 'Белкам Строй',
      image: '/logoExample.png',
    },
    {
      name: 'Венец Двери',
      image: '/logoExample.png',
    },
  ];
  return (
    <section className="section-base-padding bg-(--white)">
      <div className="grid grid-cols-1 lg:grid-cols-2 gap-8">
        <div className="w-full flex flex-col items-start justify-start gap-6 lg:gap-8">
          <h2 className="subtitle">(Сотрудничество)</h2>
          <AnimatedText as="p" className="p-medium">
            Сотрудничая с ведущими производителями и поставщиками, мы
            гарантируем вам качественные материалы, эксклюзивные условия и
            оптимальные цены. Наши партнеры — признанные лидеры отрасли,
            проверенные временем и многочисленными успешными проектами. Мы
            добиваемся для своих клиентов лучших предложений на рынке, чтобы
            каждый этап вашего проекта был реализован на высшем уровне.
          </AnimatedText>
          <ButtonPrimary>Заказать услугу</ButtonPrimary>
        </div>
        <div className="w-full flex flex-col items-start justify-center gap-6 lg:gap-8">
          <h2 className="subtitle">(Наши партнеры)</h2>
          <div className="flex flex-col items-start justify-start gap-6 lg:gap-8">
            {partners.map((partner) => (
              <div
                key={partner.name}
                className="flex items-center justify-center gap-4 sm:gap-8"
              >
                <PartherLogo />
                <span className="h3">{partner.name}</span>
              </div>
            ))}
          </div>
        </div>
      </div>
    </section>
  );
};

export default PartnersSection;

function PartherLogo() {
  return (
    <svg
      width="91"
      height="91"
      viewBox="0 0 91 91"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M50.3488 73.9164C50.4368 64.9213 48.1563 57.6066 45.2555 57.5782C42.3545 57.55 39.9316 64.8188 39.8438 73.8137C39.7558 82.8087 42.0362 90.1236 44.937 90.1518C47.838 90.1803 50.261 82.9114 50.3488 73.9164Z"
        fill="var(--black)"
      />
      <path
        d="M33.5247 71.8737C38.4621 64.3543 40.4987 56.9679 38.0738 55.3756C35.6487 53.7833 29.6803 58.588 24.7431 66.1074C19.8056 73.6267 17.769 81.013 20.1939 82.6055C22.619 84.1978 28.5872 79.393 33.5247 71.8737Z"
        fill="var(--black)"
      />
      <path
        d="M20.4555 61.0853C28.6746 57.4295 34.3815 52.317 33.2024 49.6663C32.0235 47.0156 24.4049 47.8306 16.1859 51.4865C7.96689 55.1423 2.2599 60.2548 3.43894 62.9055C4.61796 65.5562 12.2366 64.7412 20.4555 61.0853Z"
        fill="var(--black)"
      />
      <path
        d="M32.2162 42.2332C32.6576 39.366 25.8079 35.9322 16.9174 34.5638C8.02659 33.1953 0.461496 34.4105 0.0201823 37.2778C-0.421131 40.1451 6.42844 43.5786 15.3192 44.9471C24.2098 46.3155 31.775 45.1003 32.2162 42.2332Z"
        fill="var(--black)"
      />
      <path
        d="M35.4082 35.4028C37.3294 33.2291 33.4227 26.6378 26.6824 20.6808C19.9422 14.7238 12.9207 11.6569 10.9996 13.8307C9.07842 16.0044 12.9851 22.5957 19.7254 28.5528C26.4657 34.5098 33.4872 37.5766 35.4082 35.4028Z"
        fill="var(--black)"
      />
      <path
        d="M41.7652 31.4106C44.5566 30.6207 44.834 22.9636 42.3847 14.3081C39.9355 5.65259 35.687 -0.723758 32.8956 0.066142C30.1042 0.856042 29.8268 8.51305 32.276 17.1687C34.7253 25.824 38.9738 32.2005 41.7652 31.4106Z"
        fill="var(--black)"
      />
      <path
        d="M59.0269 17.4379C61.6464 8.83232 61.5202 1.17131 58.7448 0.326527C55.9695 -0.518272 51.5961 5.77305 48.9766 14.3786C46.3572 22.9841 46.4835 30.6452 49.2588 31.4899C52.0342 32.3347 56.4075 26.0435 59.0269 17.4379Z"
        fill="var(--black)"
      />
      <path
        d="M71.3611 29.0657C78.2165 23.2416 82.2514 16.7279 80.3729 14.5171C78.4947 12.3062 71.4146 15.2354 64.5593 21.0593C57.7038 26.8834 53.6691 33.3971 55.5474 35.608C57.4256 37.8189 64.5058 34.8899 71.3611 29.0657Z"
        fill="var(--black)"
      />
      <path
        d="M75.4396 45.5208C84.3556 44.3279 91.2715 41.03 90.8868 38.1545C90.5022 35.2792 82.9625 33.9152 74.0464 35.1079C65.1306 36.3007 58.2145 39.5986 58.5993 42.4741C58.984 45.3495 66.5236 46.7136 75.4396 45.5208Z"
        fill="var(--black)"
      />
      <path
        d="M86.9413 63.7275C88.1724 61.1007 82.5674 55.8767 74.422 52.0594C66.2768 48.2421 58.6758 47.2772 57.4447 49.904C56.2136 52.531 61.8186 57.755 69.964 61.5723C78.1092 65.3894 85.7103 66.3545 86.9413 63.7275Z"
        fill="var(--black)"
      />
      <path
        d="M69.8079 83.1099C72.2637 81.5658 70.3731 74.1405 65.585 66.5253C60.797 58.9101 54.9244 53.9888 52.4685 55.5329C50.0126 57.077 51.9033 64.5022 56.6913 72.1174C61.4794 79.7326 67.352 84.6542 69.8079 83.1099Z"
        fill="var(--black)"
      />
    </svg>
  );
}
