export const services = [
  {
    title: 'Замер',
    description:
      'Точный замер — важный этап работы с дверьми. Мы учитываем все особенности помещения и материалов.После выбора продукта проводим замер на адресе клиента. Формируем техническое задание для монтажников и строителей',
  },
  {
    title: 'Монтаж',
    description:
      'Устанавливаем продукцию клиента аккуратно и надёжно, используя профессиональные инструменты и следуя техническим требованиям. В результате изделия будет служить долго и работать исправно',
  },
  {
    title: 'Технический Надзор',
    description:
      'Помогаем выбрать продукт с учётом пожеланий по цене, качеству и техническим особенностям. Учитываем стиль интерьера, разрабатываем проект по установке дверей и сдвижных систем',
  },
  {
    title: 'Школа Монтажа',
    description:
      'Проводим регулярный набор в школу монтажа с собственной обучающей программой, в которой готовим квалифицированных специалистов',
    link: '/teaching',
  },
] as const;
